IDENTIFICATION DIVISION.
PROGRAM-ID. STUDENT-RECORD.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.

FILE-CONTROL.
    SELECT STUDENT-FILE ASSIGN TO "/Users/takuhara-alt/Desktop/meike-it/cobol/びっくシステム/students.txt"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.

FD STUDENT-FILE.
01 STUDENT-RECORD-REC.
    05 STUDENT-ID    PIC X(10).
    05 STUDENT-NAME  PIC X(40).
    05 BORROW-DATE   PIC X(10).

WORKING-STORAGE SECTION.
01 WS-EOF          PIC X VALUE 'N'.
01 WS-STUDENT-ID   PIC X(10).
01 WS-STUDENT-NAME PIC X(40).
01 WS-BORROW-DATE  PIC X(10).

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    OPEN EXTEND STUDENT-FILE
    PERFORM UNTIL WS-EOF = "Y"
        DISPLAY "学籍番号を入力してください。(終了するにはendと入力してください):"
        ACCEPT WS-STUDENT-ID
        IF WS-STUDENT-ID = "end"
            MOVE 'Y' TO WS-EOF
        ELSE
            DISPLAY "名前を入力してください。"
            ACCEPT WS-STUDENT-NAME
            DISPLAY "借りた日を入力してください (YYYYMMDD):"
            ACCEPT WS-BORROW-DATE
            MOVE WS-STUDENT-ID TO STUDENT-ID
            MOVE WS-STUDENT-NAME TO STUDENT-NAME
            MOVE WS-BORROW-DATE TO BORROW-DATE
            WRITE STUDENT-RECORD-REC
        END-IF
    END-PERFORM
    CLOSE STUDENT-FILE

    DISPLAY "プログラムが終了しました。"
    STOP RUN.
